{
  "types": {
    "ISTJ": {
      "name": "务实负责型",
      "summary": "你重视规则与秩序，做事稳健可靠，习惯用事实和经验说话，是团队中值得托付的人。",
      "advice": "在坚持原则的同时，可以适当分享自己的感受，多给他人一些情绪上的回应，会让合作更顺畅。",
      "career": "在有清晰流程和标准的环境中表现稳定可靠，适合从事项目管理、质量管理、财务、运营、行政等需要细致、守时和负责任的岗位。你擅长把事情按既定规则一步步推进，保证结果落地。",
      "relationship": "在人际关系中，你更习惯用行动而非语言表达关心，重视承诺和可靠性。你不太喜欢情绪化的场景，但会默默记住对方的需求并落实在具体安排上。",
      "cautions": [
        "容易对自己和他人要求过高，以“对/错”“应该/不应该”来评估行为，忽略情境的弹性。",
        "面对变化或模糊时可能本能地抗拒，过于依赖旧经验，导致适应新规则的节奏偏慢。",
        "习惯把情绪收起来独自消化，长期下来可能让别人难以读懂你的真实状态。"
      ]
    },
    "ISFJ": {
      "name": "守护照料型",
      "summary": "你细腻体贴，善于照顾他人的需求，愿意在幕后默默付出，是团队中的稳定力量。",
      "advice": "在照顾他人的同时，也要给自己留出空间，适时表达边界和需求，才能长期稳定地付出。",
      "career": "你在需要耐心、细致和稳定投入的岗位上表现突出，例如行政支持、客户服务、护理、教学、HR 等。你擅长照顾细节，维护秩序，让团队在安稳的环境中运转。",
      "relationship": "你敏感细腻，很在意他人的感受，会主动记住对方的喜好与习惯，用周到的照顾表达关心。与亲近的人相处时，你期望彼此可靠、稳定，但不一定擅长直接表达自己真正的需要。",
      "cautions": [
        "容易把“照顾大家”当成自己的责任，长期忽略自己的感受与极限。",
        "不擅长拒绝，害怕让人失望，从而承担超出能力或意愿的任务。",
        "面对冲突时倾向于回避或自责，可能需要练习更直接、温和地表达不满。"
      ]
    },
    "INFJ": {
      "name": "洞察策划型",
      "summary": "你敏感而有洞察力，关注长期价值和他人的成长，常常扮演策划者和支持者的角色。",
      "advice": "你的直觉很宝贵，但也可以主动把想法说出来，与更多人共创，避免独自承担过多压力。",
      "career": "你适合在关注意义、成长与长期规划的岗位发挥价值，例如咨询、教练、心理相关工作、HRBP、产品策划、品牌策略等。你擅长从复杂信息中抽取趋势，为个人或团队提供方向性建议。",
      "relationship": "在人际关系中，你重视深度与真实性，倾向于少而稳的亲密关系。你很会读空气，能敏锐感知他人情绪，但不总会把自己的困惑说出口，容易在内心默默承受。",
      "cautions": [
        "容易过度解读他人的言行，把尚不确定的信号视为“已经定局”。",
        "习惯自己消化压力，不愿麻烦别人，长期可能形成隐形的累积怨气。",
        "对“理想关系/理想自己”标准较高，需留意在现实中给自己更多宽容与弹性。"
      ]
    },
    "INTJ": {
      "name": "战略规划型",
      "summary": "你善于从全局思考问题，擅长制定长期规划与系统方案，对效率与逻辑有高要求。",
      "advice": "在追求高标准的同时，适当关注团队的节奏与感受，解释你的想法，会让他人更愿意跟随。",
      "career": "你在需要系统思考和长期规划的领域会很有优势，例如战略规划、产品与技术架构、数据分析、研究设计等。你擅长拆解复杂问题，建立结构清晰、可复用的解决方案。",
      "relationship": "在关系中，你重视共同目标和价值观，表达关心的方式偏理性、务实。你可能不太擅长细腻的情绪回应，但一旦认定一段关系，会愿意投入长期的建设和优化。",
      "cautions": [
        "容易把“效率”和“正确”放在首位，忽略他人的情感接受度和节奏。",
        "对自己和他人要求高，可能在不自觉中传递出苛刻或挑剔的氛围。",
        "当他人观点缺乏逻辑时容易失去耐心，需要刻意练习“说给对方听得懂”的沟通方式。"
      ]
    },
    "ISTP": {
      "name": "冷静实干型",
      "summary": "你动手能力强，遇事冷静、客观，擅长在复杂环境中迅速找出关键并解决问题。",
      "advice": "可以多向他人分享你的思路与经验，这不仅能帮助团队，也能让你的价值被更清晰地看到。",
      "career": "你适合在需要动手能力和现场判断的环境中工作，例如工程维护、技术支持、研发、运维、应急处理等。你冷静客观，擅长在混乱中快速定位问题、找到可行解。",
      "relationship": "你不喜欢情绪过度渲染，更愿意用实际帮助、解决问题来表达关心。你重视个人空间和自由节奏，喜欢在关系中保留一定独立性。",
      "cautions": [
        "在冲突或压力情境中可能选择“消失”“不回应”，让对方感到被冷落。",
        "不擅长长篇情绪对话，容易被误解为“不在乎”“不认真”。",
        "偏好即时决策与尝试，需留意在关键事务上和他人提前沟通风险与后果。"
      ]
    },
    "ISFP": {
      "name": "温柔体验型",
      "summary": "你温和平实，重视真实感受与当下体验，喜欢以自己的节奏悄然完成高质量的工作。",
      "advice": "在尊重内心节奏的同时，也可以适度表达自己的想法和审美，你的观点往往比你想象得更重要。",
      "career": "你在需要审美感受、细腻体验和稳定节奏的岗位表现良好，例如设计、手作/工艺、视觉内容、文案、艺术相关工作，或需要耐心服务的前线岗位。你重视工作与生活的和谐度。",
      "relationship": "你温和体贴，不喜欢强硬对抗，更擅长在安静陪伴或小小细节中表达爱。你希望被温柔对待，也希望对方尊重你的节奏与边界。",
      "cautions": [
        "面对不舒服的事情时，可能选择装作没事，长期积累后才一次性爆发。",
        "很难对喜欢的人说“不”，容易让自己处于委屈或透支状态。",
        "在重要决定上可能拖延或犹豫，需要给自己一些明确的时间点与行动计划。"
      ]
    },
    "INFP": {
      "name": "理想主义型",
      "summary": "你重视价值观与意义，对人和世界有自己的理想与期望，常常在内心进行丰富的思考。",
      "advice": "可以尝试把理想拆解成具体可行的小步骤，在现实中一点点落地，你的理想值得被看见。",
      "career": "你更在意工作的意义感，适合从事写作/内容、教育、公益、心理相关、产品与品牌故事等岗位。你愿意为认同的价值和理念投入大量精力，并在创意和表达上有优势。",
      "relationship": "你情感细腻，容易在关系中投入很深，对“被理解”和“被看见”有很强的期待。你通常温柔而包容，但内心标准较高，也容易在失望时悄然抽离。",
      "cautions": [
        "容易在脑海中构建“理想的自己/对方/关系”，现实与理想差距会带来较大落差感。",
        "情绪低落时倾向于内耗与自责，而非向外求助或行动调整。",
        "在设置边界与表达不满时较为困难，需练习把“感受”转化为具体、清晰的需求表达。"
      ]
    },
    "INTP": {
      "name": "理性分析型",
      "summary": "你好奇心强，喜欢研究本质问题，擅长搭建逻辑框架，是思考型与创意型工作的重要力量。",
      "advice": "在深入思考的同时，可以有意识地关注执行与落地，多与实践者合作，让好点子真正发生。",
      "career": "你适合在需要抽象思考和系统搭建的领域工作，例如研发、算法、架构设计、策略分析、咨询、知识产品等。你擅长提出新思路、构建模型，为复杂问题寻找优雅解法。",
      "relationship": "在关系中，你更习惯用讨论观点、分享知识来建立连接。你不太擅长频繁的小情绪互动，可能忽略日常的仪式感和关系维护节奏。",
      "cautions": [
        "容易陷入长时间的分析与比较，推迟决策或行动，给他人造成“拖延”“不定”的印象。",
        "喜欢就事论理，辩论时可能忽略对方的情绪承受度。",
        "对日常琐事与关系维护缺乏耐心，需要刻意安排一些“例行维护”的时间。"
      ]
    },
    "ESTP": {
      "name": "行动挑战型",
      "summary": "你反应敏捷、喜欢尝试，擅长在现场做决策，也乐于在变化环境中寻找机会。",
      "advice": "适当为自己预留复盘时间，思考长期影响，可以让你的敏捷与行动力发挥得更持久稳定。",
      "career": "你在需要即时反应和现场判断的岗位上优势明显，例如销售、商务拓展、渠道运营、现场运营、应急管理等。你勇于尝试新方案，善于抓住即时机会。",
      "relationship": "你直率、大方，喜欢和人当面互动，通过一起体验活动来拉近关系。你不太习惯长时间的情绪拉扯，更偏好直接、开门见山的沟通。",
      "cautions": [
        "容易因为追求“当下好玩”而忽略中长期的代价与承诺。",
        "在冲突中可能反应过快、话说得太满，事后需要花时间修复关系。",
        "习惯凭临场感觉做决定，需在关键节点上多预留一点思考和复盘时间。"
      ]
    },
    "ESFP": {
      "name": "活力表达型",
      "summary": "你热情外向，关注当下体验，善于活跃氛围，让身边的人感到轻松愉快。",
      "advice": "在照顾氛围之余，也可以偶尔停下来，想一想自己真正想要什么，让热情更好地为自己服务。",
      "career": "你在需要与人频繁互动、营造氛围的岗位中表现亮眼，例如活动运营、销售顾问、培训主持、主播/内容创作、客服等。你能快速察觉现场气氛并做出调整。",
      "relationship": "你热情外向，善于用幽默和陪伴带给身边人愉悦感。你不喜欢过于压抑或冷淡的关系，倾向于用轻松方式处理矛盾，有时会回避更沉重的话题。",
      "cautions": [
        "容易为了“大家开心”忽略自己真实的疲惫或不满。",
        "在消费和时间安排上可能偏向随性，需要适度规划以避免事后压力。",
        "面对严肃对话或长期承诺时可能有逃避倾向，需要刻意面对并表达真实立场。"
      ]
    },
    "ENFP": {
      "name": "灵感驱动型",
      "summary": "你充满好奇与创意，善于发现可能性，喜欢与人连接并激发他人的热情。",
      "advice": "可以尝试给灵感设定一些边界和优先级，把部分想法落到具体计划上，避免精力被过度分散。",
      "career": "你在需要创意、连接人与点子的场景中很有优势，例如品牌与市场、创新项目、产品探索、组织发展、社区运营等。你善于启动新项目、调动他人热情。",
      "relationship": "你重视灵魂层面的交流，擅长倾听和共情，也喜欢在关系中一起探索新鲜体验。你在关系初期通常投入度高，但在进入稳定日常后可能感到乏味。",
      "cautions": [
        "兴趣点多，容易“广撒网、少收尾”，导致项目与关系都缺少稳定沉淀。",
        "对他人回应较为敏感，容易过度解读对方的情绪或语气。",
        "需要注意在照顾他人感受的同时，也清晰表达自己的底线与节奏。"
      ]
    },
    "ENTP": {
      "name": "辩证创新型",
      "summary": "你思维敏捷，喜欢挑战既有观点，从不同角度论证问题，常能提出意想不到的方案。",
      "advice": "在享受讨论的同时，也要留意他人的感受与节奏，适度收敛锋芒，有助于长久合作关系。",
      "career": "你适合在需要不断提出新观点和挑战现状的环境中工作，例如创新业务、战略咨询、产品探索、创业、媒体与内容策划等。你擅长从不同角度拆解问题并找到非传统解法。",
      "relationship": "在关系中，你机智幽默，喜欢通过“斗嘴”和观点碰撞来建立亲密感。对你来说，好玩、有思想交流的关系比形式上的浪漫更重要。",
      "cautions": [
        "喜欢辩论和拆台，有时会让对方感到被挑衅或不被尊重。",
        "容易在新鲜感消退后失去耐心，需要刻意练习长期陪伴与落实细节。",
        "对规则和约束不耐烦，在团队或亲密关系中需要平衡个人自由与共同约定。"
      ]
    },
    "ESTJ": {
      "name": "执行管理型",
      "summary": "你重视秩序和效率，擅长组织资源、推动落地，是天然的执行者和管理者。",
      "advice": "在坚持标准的同时，多听听不同声音，适当留出弹性空间，往往能收获更好的整体效果。",
      "career": "你在需要组织资源、制定流程并确保执行到位的岗位上表现突出，例如项目管理、运营管理、团队负责人、行政管理等。你擅长把目标拆解成具体步骤并推动落实。",
      "relationship": "在关系中，你讲原则、重承诺，习惯用“解决问题”的方式表达关心。你会在乎对方是否负责、是否守约，对“说一套做一套”较难容忍。",
      "cautions": [
        "容易把自己的标准当成“唯一正确方式”，在无意间给他人较大压力。",
        "表达直接，有时在语气上显得过于强硬，削弱了本意中的关心。",
        "在面对情绪问题时容易急于给出解决方案，而忽略单纯的理解和陪伴。"
      ]
    },
    "ESFJ": {
      "name": "协调支持型",
      "summary": "你乐于维护团队和谐，重视责任与承诺，善于在关系网络中进行协调与照应。",
      "advice": "可以学着区分“我应该”与“我想要”，在承担责任之外，也照顾好自己的节奏与界限。",
      "career": "你在需要协调人与资源、维护关系氛围的岗位上很有优势，例如 HR、客户成功、班主任/教务、行政协调、社区运营等。你擅长建立照顾周全的支持系统。",
      "relationship": "你很愿意为身边的人付出时间和精力，主动组织聚会、记住重要日子，让大家感到被照顾和被连接。你也在意他人对自己的评价和反馈。",
      "cautions": [
        "过于关注他人感受和外界评价，容易忽略自己的真实需要。",
        "不擅长处理负面冲突，可能选择用忙碌和服务来掩盖不满。",
        "容易把“维持和谐”放在第一位，压抑真实观点，长期下来会感到疲惫。"
      ]
    },
    "ENFJ": {
      "name": "鼓舞引导型",
      "summary": "你关注他人的潜力与情绪，擅长激励和组织，是天然的引导者与支持者。",
      "advice": "在投入大量精力帮助他人时，也别忽略自己的需要，适时补充能量，才能持续地给予。",
      "career": "你适合在需要引导、激励和培育他人的岗位上工作，例如培训讲师、教练/咨询、HR 与组织发展、团队负责人、社群运营等。你擅长看见他人潜力并为其设计成长路径。",
      "relationship": "在关系中，你会投入大量精力去理解和照顾对方，希望成为对方可以依赖的支撑者。你重视互动质量，也很敏感对方的情绪变化。",
      "cautions": [
        "容易在关系中承担过多责任，把别人的问题也揽在自己身上。",
        "在关心他人时可能不自觉地带入“指导/劝说”姿态，让对方感到压力。",
        "长期把注意力放在他人身上，可能忽略自己真正的感受和界限。"
      ]
    },
    "ENTJ": {
      "name": "果断领航型",
      "summary": "你目标感强，善于统筹规划和决策，愿意为长期愿景承担责任，是典型的领导型人格。",
      "advice": "在追求结果与效率的同时，适度放慢节奏、倾听他人感受，会让你的领导更具温度与凝聚力。",
      "career": "你在需要决策、统筹和带领团队达成目标的岗位上具备明显优势，例如业务负责人、项目总监、创业者、咨询顾问等。你擅长设定方向、分配资源并推动执行。",
      "relationship": "在关系中，你希望彼此在目标感和能力上是可以并肩的伙伴关系。你表达直接、务实，习惯用“共同规划未来”的方式来体现重视。",
      "cautions": [
        "容易在无意间把工作节奏带入所有关系，对效率与结果的强调让对方感到紧绷。",
        "对他人失误容忍度不高，容易在语气上显得批评性较强。",
        "需要刻意练习放慢节奏，倾听和共情，而不仅是给出解决方案。"
      ]
    }
  }
}
